app/Http/Controllers/DashboardController.php

select * from `ideas` order by `created_at` desc limit 5 offset 5
select count(*) as aggregate from `ideas`
---
    public function index(){

        $ideas = Idea::without('user')->orderBy('created_at', 'DESC');
            // $ideas = Idea::orderBy('created_at', 'DESC');


        if(request()->has('search')){
            $ideas = $ideas->where('content', 'like', '%' . request()->get('search','') . '%');
        }

        return view('dashboard',[
            'ideas' => $ideas->paginate(5)
        ]);