app/Http/Controllers/FeedController.php

    public function __invoke(Request $request)
    {
        $user = auth()->user();
        $followingIDs = $user->followings()->pluck('user_id');
        $ideas = Idea::whereIn('user_id',$followingIDs)->latest();




        if(request()->has('search')){
            $ideas = $ideas->where('content', 'like', '%' . request()->get('search','') . '%');
        }

        return view('dashboard',[
            'ideas' => $ideas->paginate(5)
        ]);
---
select * from `ideas` where `user_id` in (2) order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `ideas` where `user_id` in (2)